#### Current Property

---

|  |
| --- |
| ConduitSizeSettingIterator Class   See Also |

Gets the item at the current position of the iterator.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public virtual KeyValuePair<string, ConduitSizes> Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As KeyValuePair(Of String, ConduitSizes) 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property KeyValuePair<String^, ConduitSizes^> Current { 	KeyValuePair<String^, ConduitSizes^> get (); } ``` |

#### Implements

 IEnumerator T Current

# Remarks

There is no current item if the iterator has not started yet or has been done.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | There is no current item in the iterator. |

# See Also

ConduitSizeSettingIterator Class

Autodesk.Revit.DB.Electrical Namespace